app/views/admin/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
            <td> <%= post.title %> </td>
            <td> <%= User.find_by_id(post.user_id).username %> </td>