app/views/posts/_post.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
    Author:
    <% @author = User.find_by_id(post.user_id) %>