app/controllers/admin_controller.rb

  def index
    @posts = Post.order('created_at DESC')
    @users = User.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "users".* FROM "users" ORDER BY created_at DESC