app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published" = 't' ORDER BY published_at DESC, created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."published" = 't'
---
  def index
    @posts = Post.where(:published => true).order("published_at DESC").paginate(:page => params[:page], :order=>'created_at desc',
      :per_page => 5)

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'thoughts-of-a-rails-and-ruby-beginner' LIMIT 1
---
  def show
    @post = Post.find_by_slug!(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'efwfe' LIMIT 1
---
  def edit
    @post = Post.find_by_slug!(params[:id])

INSERT INTO "posts" ("content", "content_md", "created_at", "published", "published_at", "slug", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'prova' LIMIT 1
UPDATE "posts" SET "title" = 'AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN AIUNIGVTYULVBBN ', "slug" = 'aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn-aiunigvtyulvbbn', "updated_at" = '2012-09-23 16:15:36.749330' WHERE "posts"."id" = 18
---
  def update
    #@post = Post.find(params[:id])
    @post = Post.find_by_slug!(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])